"""Програма-світлофор.
   Створити програму-емулятор світлофора для авто і пішоходів. 
   Після запуска програми на екран виводиться в лівій половині - колір автомобільного, 
   а в правій - пішохідного світлофора. Кожну 1 секунду виводиться поточні кольори. 
   Через декілька ітерацій - відбувається зміна кольорів - логіка така сама як і в звичайних 
   світлофорах (пішоходам зелений тільки коли автомобілям червоний)."""

from time import sleep


def traffic_light():
    
    while True:
        
        for i in range(1,5):
            print("Red     Green")
            sleep(1)
        for i in range(1,3):
            print("Yellow  Red")
            sleep(1)
        for i in range(1,5):
            print("Green   Red")
            sleep(1)
        for i in range(1,3):
            print("Yellow  Green")
            sleep(1)
            
traffic_light()
