"""4. Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді коду Морзе 
та виводить декодоване значення (латинськими літерами).
   Особливості:
    - використовуються лише крапки, тире і пробіли (.- )
    - один пробіл означає нову літеру
    - три пробіли означають нове слово
    - результат може бути case-insensitive (на ваш розсуд - великими чи маленькими літерами).
    - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки тощо використовуватися не будуть. Лише латинські літери.
    - додайте можливість декодування сервісного сигналу SOS (...---...)
    Приклад:
    --. . . -.- .... ..-- -...   .. ...   .... . .-. .
    результат: GEEKHUB IS HERE"""


morse = input("Morse: ")

# --. . . -.- .... ..- -...   .. ...   .... . .-. .
# -.-. .- -   .. ...   ..-. .- -
# ...---...

def morse_code(morse):
    
    my_dict = { 
        '.-': 'A', 
        '-...': 'B',
        '-.-.': 'C', 
        '-..': 'D', 
        '.': 'E',
        '..-.': 'F',
        '--.': 'G', 
        '....': 'H',
        '..': 'I', 
        '.---': 'J', 
        '-.-': 'K',
        '.-..': 'L', 
        '--': 'M', 
        '-.': 'N',
        '---': 'O', 
        '.--.': 'P', 
        '--.-': 'Q',
        '.-.': 'R', 
        '...': 'S', 
        '-': 'T',
        '..-': 'U', 
        '...-': 'V', 
        '.--': 'W',
        '-..-': 'X', 
        '-.--': 'Y', 
        '--..': 'Z', 
        '*': ' ', 
        '...---...': 'SOS'
    }
    
    s = morse.replace('   ', ' * ')
    sentence = s.split(" ")
    
    english = [] 
    for i in sentence:
        if i in my_dict:
            english.append(my_dict[i])
    return "".join(english)
    
print(morse_code(morse))
