"""2. Написати функцію <bank> , яка працює за наступною логікою: користувач робить вклад у розмірі 
<a> одиниць строком на <years> років під <percents> відсотків (кожен рік сума вкладу збільшується на цей відсоток, 
ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки). Параметр <percents> є 
необов'язковим і має значення по замовчуванню <10> (10%).
Функція повинна принтануть суму, яка буде на рахунку, а також її повернути (але округлену до копійок)."""

def bank():
    money = int(input("Money: "))
    years = int(input("Years: "))
    percent = 0.1
    
    for i in range(years):
        amount = money * (pow((1 + 0.1/1), 1 * (i + 1)))
        result = "{:.2f}".format(amount)
        print(f"Total: ${amount}")
    return f"Total: ${result}"
  
print(bank())
