"""7. Напишіть функцію, яка приймає 2 списки.
 Результатом має бути новий список, в якому знаходяться
 елементи першого списку, яких немає в другому.
 Порядок елементів, що залишилися має відповідати порядку
 в першому (оригінальному) списку. Реалізуйте обчислення за допомогою
 генератора в один рядок.

    Приклад:
    array_diff([1, 2], [1]) --> [2]
    array_diff([1, 2, 2, 2, 3, 4], [2]) --> [1, 3, 4]""'



my_list1 = [1,2,3,4,5]
my_list2 = [3,4,6,7,8]



def merge_list(my_list1, my_list2):
    result = [element for element in my_list1 if element not in my_list2] 
    print(result)

merge_list(my_list1, my_list2)

